Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType
The Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType enum defines the dimension end point size types.
The size can be dynamic or fixed.

Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType.Dynamic
The size is based on the dimension value of the associated measurement graphic.

Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType.FixedExtraSmall
The size is extra small. The size does not depend on the dimension value.

Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType.FixedSmall
The size is small. The size does not depend on the dimension value.

Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType.FixedMedium
The size is medium. The size does not depend on the dimension value.

Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType.FixedLarge
The size is large. The size does not depend on the dimension value.

Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType.FixedExtraLarge
The size is extra large. The size does not depend on the dimension value.